       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
      *hyeeeeeeeeeeeeeeeeeeeeeeeeeeeeee
       PROCEDURE DIVISION.
           DISPLAY 'Hello r'.
           DISPLAY '12345bdxf'
           STOP RUN.

